Lmx2315/STM32_B330/temp_Pj1/Inc/main.h
#define PD10_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10,GPIO_PIN_RESET)
#define PD10_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_10,GPIO_PIN_SET)

#define PD11_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_11,GPIO_PIN_RESET)
#define PD11_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_11,GPIO_PIN_SET)

#define PD12_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_RESET)
#define PD12_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_12,GPIO_PIN_SET)

#define PD13_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_RESET)
#define PD13_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_13,GPIO_PIN_SET)

#define PD14_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_RESET)
#define PD14_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_14,GPIO_PIN_SET)

#define PD15_0  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_RESET)
#define PD15_1  HAL_GPIO_WritePin(GPIOD, GPIO_PIN_15,GPIO_PIN_SET)

//---------------------------
#define PE0_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_0,GPIO_PIN_RESET)
#define PE0_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_0,GPIO_PIN_SET)

#define PE1_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1,GPIO_PIN_RESET)
#define PE1_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_1,GPIO_PIN_SET)

#define PE2_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2,GPIO_PIN_RESET)
#define PE2_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_2,GPIO_PIN_SET)

#define PE3_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3,GPIO_PIN_RESET)
#define PE3_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3,GPIO_PIN_SET)

#define PE4_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_4,GPIO_PIN_RESET)
#define PE4_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_4,GPIO_PIN_SET)

#define PE5_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_5,GPIO_PIN_RESET)
#define PE5_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_5,GPIO_PIN_SET)

#define PE6_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_6,GPIO_PIN_RESET)
#define PE6_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_6,GPIO_PIN_SET)

#define PE7_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7,GPIO_PIN_RESET)
#define PE7_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_7,GPIO_PIN_SET)

#define PE8_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8,GPIO_PIN_RESET)
#define PE8_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_8,GPIO_PIN_SET)

#define PE9_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_9,GPIO_PIN_RESET)
#define PE9_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_9,GPIO_PIN_SET)

#define PE10_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_10,GPIO_PIN_RESET)
#define PE10_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_10,GPIO_PIN_SET)

#define PE11_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_11,GPIO_PIN_RESET)
#define PE11_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_11,GPIO_PIN_SET)

#define PE12_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_12,GPIO_PIN_RESET)
#define PE12_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_12,GPIO_PIN_SET)

#define PE13_0  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_13,GPIO_PIN_RESET)
#define PE13_1  HAL_GPIO_WritePin(GPIOE, GPIO_PIN_13,GPIO_PIN_SET)

#define PE14_0 HAL_GPIO_WritePin(GPIOE, GPIO_PIN_14,GPIO_PIN_RESET)
#define PE14_1 HAL_GPIO_WritePin(GPIOE, GPIO_PIN_14,GPIO_PIN_SET)

#define PE15_0 HAL_GPIO_WritePin(GPIOE, GPIO_PIN_15,GPIO_PIN_RESET)
#define PE15_1 HAL_GPIO_WritePin(GPIOE, GPIO_PIN_15,GPIO_PIN_SET)
//----------------------
#define RESET_072(a) ((a==1)?PB0_1 : PB0_0)

#define VD3(a) ((a==1)?PC13_1 : PC13_0)
#define VD4(a) ((a==1)?PC14_1 : PC14_0)
#define VD5(a) ((a==1)?PC15_1 : PC15_0)

#define PWDN_4(a) ((a==1)?PC1_1 : PC1_0)
  
#define CS_5_MK(a)     ((a==1)?PE10_1 : PE10_0)
#define CS_SLAVE_5_MK(a) ((a==1)?PE11_1 : PE11_0)
#define CS_2_MK(a)       ((a==1)?PB12_1 : PB12_0)

#define OE_SCLK_SLAVE_5_MK(a)   ((a==1)?PD10_1 : PD10_0)
#define UPR_HDS_MK(a)       ((a==1)?PD12_1 : PD12_0)
#define ENABLE_LM25056_MK(a)    ((a==1)?PD14_1 : PD14_0)
#define RESET_TCA6424A_MK(a)    ((a==1)?PD15_1 : PD15_0)
#define SMBA_LM25056_MK(a)    ((a==1)?PC6_1 : PC6_0)

#define POK_HDS_OUT         HAL_GPIO_ReadPin(GPIOD,GPIO_PIN_9)
#define INT_TCA6424A_MK     HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_7)
#define FLAG_MIC29151       HAL_GPIO_ReadPin(GPIOC,GPIO_PIN_8)

#define CS_EPCS1(a)   ((a==1)?PD0_1 : PD0_0)
#define CS_EPCS2(a)   ((a==1)?PD1_1 : PD1_0)
#define DE_RS485(a)   ((a==1)?PD4_1 : PD4_0)
#define NRE_RS485(a)    ((a==1)?PD7_1 : PD7_0)
#define WDI_MK(a)     ((a==1)?PB9_1 : PB9_0)
#define RES_4(a)      ((a==1)?PE0_1 : PE0_0)
#define NSS_4(a)        ((a==1)?PE4_1 : PE4_0)

//------------------------------------------------
//                 JTAG

#define TDO()  HAL_GPIO_ReadPin(GPIOB,GPIO_PIN_14)
#define TDI(a)  ((a==1)?PB15_1 : PB15_0)
#define TCK(a)  ((a==1)?PB13_1 : PB13_0)
#define TMS(a)  ((a==1)?PB12_1 : PB12_0)

#define ALIGN(x, n) (((x) + (n) - 1) & ~((n) - 1))
#undef MIN
#define MIN(x, y)  (((x) < (y)) ? (x) : (y))
#undef MAX
#define MAX(x, y)  (((x) > (y)) ? (x) : (y))

//typedef unsigned int bool;

//------------EPCS 128----------
#define WRITE_ENABLE	0x6
#define WRITE_DISABLE	0x4
#define READ_STATUS		0x5
#define READ_BYTES		0x3    
#define READ_ID		  	0xab	  
#define FAST_READ	    0x0b    
#define WRITE_STATUS	0x01
#define WRITE_BYTES		0x02	 
#define ERASE_BULK		0xc7
#define ERASE_SECTOR	0xd8	  
#define READ_DEV_ID		0x9f  

#define ssize_t long
#define mode_t unsigned int

//------------------------------------------------

#define u64 unsigned long long
#define u32 unsigned int
#define u16 unsigned short
#define u8  uint8_t

//---------------------------------------------------------------------

// USART1 Receiver buffer
#define RX_BUFFER_SIZE1 64u
#define Bufer_size    8192u   //16384

// USART2 Receiver buffer
#define RX_BUFFER_SIZE2 64u
#define Bufer_size2   1024u   //16384

#define buf_IO        64u 
#define buf_Word      64u 
#define buf_DATA_Word 200u 
#define BUFFER_SR     200u
#define BUF_STR       64
#define MAX_PL        157u

#define BUF_DATA_SZ   256

//------------------------------------------------

/* typedef struct     //структура ответной квитанции
{
  u32 Cmd_size;   //размер данных
  u32 Cmd_type;   //тип квитанции
  u32 Cmd_id;     //ID квитанции
  u32 Cmd_time;   //время формирования квитанции (сразу после выполнения команды)
  u8  Cmd_data[32]; //данные квитанции - 0-выполненна , 1 - не выполненна
  u32 N_sch;      //число подготовленных квитанций
}INVOICE;
 */


#define MSG_REPLY          1
#define MSG_ERROR          2
#define MSG_ERROR_CMD_BUF  7 //были затёртые команды в буфере
#define MSG_CMD_OK         3 //команда выполненна успешно
#define MSG_STATUS_OK    100 //Квитация на статус

#define MSG_ID_CH1    101 //сообщаем ID миксросхемы LM в канале 1
#define MSG_ID_CH2    102 //
#define MSG_ID_CH3    103 //
#define MSG_ID_CH4    104 //
#define MSG_ID_CH5    105 //
#define MSG_ID_CH6    106 //
#define MSG_ID_CH7    107 //
#define MSG_ID_CH8    108 //

