Lmx2315/STM32_B330/temp_Pj1/Inc/main.h
#define MSG_TEMP_CH1    111 //сообщаем температуру миксросхемы LM в канале 1
#define MSG_TEMP_CH2    112 //
#define MSG_TEMP_CH3    113 //
#define MSG_TEMP_CH4    114 //
#define MSG_TEMP_CH5    115 //
#define MSG_TEMP_CH6    116 //
#define MSG_TEMP_CH7    117 //
#define MSG_TEMP_CH8    118 //

#define MSG_U_CH1     121 //сообщаем напряжение миксросхемы LM в канале 1
#define MSG_U_CH2     122 //
#define MSG_U_CH3     123 //
#define MSG_U_CH4     124 //
#define MSG_U_CH5     125 //
#define MSG_U_CH6     126 //
#define MSG_U_CH7     127 //
#define MSG_U_CH8     128 //

#define MSG_I_CH1     131 //сообщаем напряжение миксросхемы LM в канале 1
#define MSG_I_CH2     132 //
#define MSG_I_CH3     133 //
#define MSG_I_CH4     134 //
#define MSG_I_CH5     135 //
#define MSG_I_CH6     136 //
#define MSG_I_CH7     137 //
#define MSG_I_CH8     138 //

#define MSG_P_CH1     141 //сообщаем напряжение миксросхемы LM в канале 1
#define MSG_P_CH2     142 //
#define MSG_P_CH3     143 //
#define MSG_P_CH4     144 //
#define MSG_P_CH5     145 //
#define MSG_P_CH6     146 //
#define MSG_P_CH7     147 //
#define MSG_P_CH8     148 //

#define MSG_PWR_CHANNEL    150 //сообщаем состояние линий питания каналов
#define MSG_REQ_VERSION    109 //сообщаем 	номер версии
#define MSG_REQ_NUM_SLAVE  110 //сообщаем  количество слейвов в блоке и их адреса
#define MSG_REQ_TEST_485   151 //сообщаем  результат теста проверки шины 485
#define MSG_REQ_TEST_SPI   152 //сообщаем  результат теста проверки шины SPI
#define MSG_REQ_TEST_JTAG  153 //сообщаем  результат теста проверки шины JTAG
#define MSG_Corr_REQ       154 
#define MSG_REQ_TEST_RESET 155 //сообщаем результат теста сигнала RESET
#define MSG_STATE_B072     156 //сообщаем о состоянии ячеек B072
#define MSG_STATE_B330     157 //сообщаем о состоянии ячеек B330
#define MSG_ERROR_REJ      158 //сообщаем о аварийной работе , подробности в кодах аварии
//---------Коды аварий----------------------------------------------------
#define ERROR_CODE_Imax      1   //аварийный код - превышение тока
#define ERROR_CODE_Imin      2   //аварийный код - маленький ток
#define ERROR_CODE_Umax      3   //аварийный код - превышение напряжения
#define ERROR_CODE_Umin      4   //аварийный код - маленькое напряжение
#define ERROR_CODE_REJ       5   //аварийный код - нарушение режима работы

//---------команды управления---------------------------------------------
#define CMD_TIME_SETUP       1   //команда установки точного времени, реалтайм.
#define CMD_HELP             2   //вывести в консоль HELP()
#define CMD_TIME             0   //вывести в консоль текущее время
#define CMD_12V              3   //включить - 1 , выключить - 0 питание +12 Вольт
#define CMD_STATUS         100 //сообщите состояние
#define CMD_LED            200 //команда управления светодиодами лицевой панели
#define CMD_xxx            300
#define CMD_CH_UP            4   //команда включения/выключения каналов питания , канал в данных передаётся (вкл/выкл - инверсные коды)
#define CMD_SETUP_IP0        5   //команда установки IP0 адреса блока 072
#define CMD_SETUP_IP1        6   //команда установки IP0 адреса блока 072
#define CMD_SETUP_DEST_IP0   7   //команда установки DEST_IP0 адреса блока 072
#define CMD_SETUP_DEST_IP1   8   //команда установки DEST_IP1 адреса блока 072
#define CMD_REQ_VERSION      9   //команда запроса номера версии ПО
#define CMD_REQ_NUM_SLAVE   10   //команда запроса количества блоков 072 в АЦ и их адресов
#define CMD_TEST_485        11   //команда начала теста проверки шины 485
#define CMD_TEST_SPI        12   //команда начала теста проверки шины SPI
#define CMD_TEST_JTAG       13   //команда начала теста проверки шины JTAG
#define CMD_Corr_I          201  //команда установки нового коэффициента коррекции измерения тока
#define CMD_Corr_U          202  //команда установки нового коэффициента коррекции измерения напряжения
#define CMD_Corr_REQ        203  //команда запроса списка корректирующих коэффициентов
#define CMD_NUMB_BLOCK_WR   204  //команда записи номера блока
#define CMD_RESET_072       205  //команда установки сигнала ресет или проведения теста для сигнала ресет (зависит от данных команды)
#define CMD_LED_TEST        206  //команда тестирования светодиодов на лицевой панели Б330
#define CMD_B072_START      207  //команда включения B072
#define CMD_REJ_OSNPAR      208  //команда включения режима измерения основных параметров!!!
//------------------------------------------------------------------------ 
#define SIZE_SERVER  8192  //размер буфера "Хранилище"  тут хранятся данные команды пришедших пакетов сами команды хранятся в реестре
#define SIZE_ID        128   //размер реестра  
#define quantity_CMD   32   //максимальное количество команд и количества квитанций!!!
#define quantity_DATA  512  //максимальная длинна данных
#define quantity_SENDER 1   //максимальное количество адресатов
//-----------------------------------------------------------------
//тут указываем адрес во флеш где храним наработку блока (с какого адреса)
#define ADR_TIME_OF_WORK 0x100  
//тут указываем число страниц на которых храним нароботку блока
#define N_PAGE_TIME_OF_WORK 20  
//тут указываем адрес серийного номера во флеш
#define SERIAL_ADR_FLASH 0x00000  
//тут указываем адрес коэффициента коррекции тока
#define CorrI_ADR_FLASH 0x040000
//тут указываем адрес коэффициента коррекции напряжения
#define CorrU_ADR_FLASH 0x080000

typedef struct   //структура вектора аварии
{
  u32 INDEX;  //индекс канала в котором авария
  u32 CODE;   //код аварии
  u8  ALERT;   //флаог аварии
}ERROR_STRUCT;

typedef struct    //структура параметров LM
{
  u32 TEMP;     //температура
  u32 P;        //измеренная мощность
  u32 I;        //измеренный ток
  u32 U;        //измеренное напряжение
  u8 ID[3];     //ID микросхемы
  u8  ERROR;    //авария этого канала
  u32 I_max;    //максимально допустимый ток
  u32 P_max;    //максимально допустимая потребляемая мощность
  u32 TEMP_max; //максимально допустимая температура
  u32 U_min;    //минимально допустимое напряжение
  int FI[20];   //массив фильтрации тока
  int FU[20];   //массив фильтрации напряжения
  int FP[20];
}LM_struct;

//----------------------------------------------------------------- 
typedef struct //структура команды
{
  u32 Cmd_size;
  u32 Cmd_type;
  u64 Cmd_id;
  u64 Cmd_time;
  u8  Cmd_data[quantity_DATA];
}Command;

