Lmx2315/STM32_B330/temp_Pj1/Inc/main.h
typedef struct //структура сообщения с описанием команд
{
  u32 Msg_size;
  u32 Msg_type;
  u64 Num_cmd_in_msg;
    Command CMD[quantity_CMD];
}Message;

typedef struct //структура фрейма
{
  u16 Frame_size;
  u16 Frame_number;
  u8  Stop_bit;
  u32 Msg_uniq_id;
  u64 Sender_id;
  u64 Receiver_id;
    Message MSG;    
}Frame;

typedef struct //структура "Хранилище"
{
  u8 MeM[SIZE_SERVER];
  u32 INDEX;
  u32 INDEX_LAST;
  u64 CMD_ID;
  u64 SENDER_ID;
  u64 TIME;
  u32 x1;//начало диапазона удалённых индексов
  u32 x2;//конец  диапазона удалённых индексов
}SERVER;


typedef struct //структура "реестр" (ID)
{
  u32 INDEX       [SIZE_ID];
  u64 CMD_TYPE    [SIZE_ID];
  u64 CMD_ID      [SIZE_ID];
  u64 SENDER_ID   [SIZE_ID];
  u64 TIME        [SIZE_ID];
  u8  FLAG_REAL_TIME[SIZE_ID]; //флаг реального времени
  u32 N_sch;//число записей в структуре
}ID_SERVER;

typedef struct   //структура команды на исполнение
{
  u32 INDEX;  //индекс команды в структуре SERVER 
  u64 TIME; //время исполнения
}CMD_RUN;

typedef struct
{
  u32 IDX;        //подсчитанное количество отправителей
  u64 A[quantity_SENDER]; //масств адресов ОТПРАВ
}ADR_SENDER;
//---------------------------
typedef struct  //эта структура описывает указатель для отложенных команд
{ 
  u8  FLAG;
  u32 timer;
} POINTER;


#define PNT_BUF 32 //количество указателей для массива отложенного выполнения команд
//---------------------------
typedef struct SYS_STATE_BOARD   // объявляю структуру 
{
  float Corr_I[8];//корректирующий коэффициент измерения тока
  float Corr_U[8];//корректирующий коэффициент измерения напряжения
  u8 CH[8];       //состояние каналов питания вкл/выкл 1/0
  u8  INIT;       //флаг означающий была инициализация или нет
  u16 TEMP_MAX;    //показывает максимальную температуру в блоке
  u32 I;          //показывает максимальный ток в блоке
  u32 U_min;      //показывает минимальное напряжение в блоке 
  u32 U_max;      //показывает максимальное напряжение в блоке 
  u32 P;           //показывает максимальную потребляемую мощность
  u8  FLAG_1HZ;    //этот флаг показывает наличие секундной метки
  u32 B330_NUMBER; //номер блока 
  u64 PRG_VERSIYA;//версия прошивки
  u32 WORK_TIME;  //наработка кассеты
  u8  STATUS_OK;   //обобщённое состояние

} SYS_STATE_BOARD;


typedef struct SYS_STATE_072   // объявляю структуру 
{
  int TEMP;    //максимальная температура блока
  u8  REF;     //наличие сигнала REF
  u8  SYNC_1HZ;//наличие секундной метки
  u8  ADC_0;   //состояние АЦП
  u8  ADC_1;   //состояние АЦП
  u8  DAC_0;   //состояние ЦАП
  u8  DAC_1;   //состояние ЦАП
  u8  SYNC0;   //наличие синхрометки SYNC0
  u8  SYNC1;   //наличие синхрометки SYNC1
  u32 ERROR_1HZ;//ошибка секундной метки в мкс
} SYS_STATE_072;

//---------------------------

u32 IO ( char* );
void test_delay (u32 );
u8 PIN_control_PA8 (void);
u8 PIN_control (void);
void ATT_upr (u8 ,u8 );
void FAPCH_INIT (void);
void LED (void);
void SDRAM_test_wr (u32,u16);
u16 SDRAM_test_rd (u32 ,u16); 
void test3_sdram(u16 );
void test2_SDRAM(u16 );
void test_SDRAM (u16 );
char getchar1(void);
void Menu1(char );
u64 FPGA_rSPI (u8,u8);
u64 FPGA2_rSPI(u8,u8);
u32 FPGA_wSPI (u8,u8,u64);
u32 FPGA2_wSPI(u8,u8,u64);
void spisend_FPGA (u8,u8);
u8 spisend8 (u8);
void spisend32 (u32);
void h_out (u64,u8);
void hn_out(u64,u8);
void i_out (u64,u8);
void in_out(u64,u8);
void xn_out (char *,u32);
void x_out (char *,u32);
void x32_out (char *,u32);
void nu_out (char *,u32);
void un_out (char *,u32);
void u_out (char *,u32);
void d_out (char *,int);
void f_out (char *,float);
void Transf(const char* );
unsigned int leng ( char *);
void itoa(int ,  char *, int);
volatile void delay_us( uint32_t );
void Delay( unsigned int ) ;
void ADC_test (void);
void PWM (u16);
void spi4send32 (u32 );
u8 spi4send8 (u8 );
void FRAME_DECODE (uint8 *,u32 );
void INIT_SERV_ARCHIV (SERVER *,ID_SERVER *,ADR_SENDER *);
void SERV_WR (u8 ,SERVER *);
void PRINT_SERV (void);
void PRINT_SERV_ID (void);
void STATUS_ID (ID_SERVER *);
u32 ADR_FINDER (u64 ,ADR_SENDER *); //ищем адрес отправителя в структуре адресов (его порядковый номер)
void Set_network(void);
void MSG_SHOW (void);
u32 SEND_UDP_MSG (void);
u8 DS4520_read (void);
void REQ_VERSIYA (void);
void answer_translated (u32 );
void req_col (void);
void FUNC_FLAG_UP (POINTER *,u32);
u8 FLAG_DWN (POINTER *);
void SPI_BP_WRITE (u32 ,u32 );
void spi_EPCS1_rd (u8 cmd,u8 d[],u32 n);
void SERIAL_NUMBER_WR (u32 );
void spi_EPCS2_rd (u8 cmd,u8 d[],u32 n);
void TABL_CONS (u8 *p,u32 n);
void EPCS1_WRITE_BUF(u32 adr,u8 *p,u32 n);
void EPCS2_WRITE_BUF(u32 adr,u8 *p,u32 n);
void EPCS1_ERASE_SECTOR(u32 adr);
void EPCS2_ERASE_SECTOR(u32 adr);
void EPCS1_ERASE_ALL(void);
void EPCS2_ERASE_ALL(void);
void CorrI_read (void);
void CorrU_read (void);
void CorrI_write(void); 
void CorrU_write(void); 
void Console_corr(void);
void TIME_cons (void);
void DAT_CORR_REQ_FORM (void);
void CorrIU_write (void);
void SETUP_IP0_072 (u8 ,u32);
void SETUP_IP1_072 (u8 ,u32);
void SETUP_DEST_IP0_072 (u8,u32);
void SETUP_DEST_IP1_072 (u8,u32);
u64 SERIAL_NUMBER (void);
u16 ARR_B330 (void);
void ALARM_SYSTEM (ID_SERVER *,SERVER *);
void FUNC_TEST_FIND (void);
//-------------JTAG--------------
void JTAG_SCAN (void);
  u8 SCAN_N    (void);
void ID_recive (u8  );
//-------------------------------
u16 ARR_B072 (void);

u32 ERROR_CMD_MSG //формирует структуру квитанции уровня CMD
(
ID_SERVER *,  //указатель на структуру "реестр" 
Frame *,    //указатель на структуру квитанции
u32 ,     //индекс в реестре
u32 ,     //тип сообщения
u32 ,     //данные сообщения
u32       //время составления квитанции
);

u32 SERV_ID_WR  //функция заполнения реестра команд
(
Frame  *,    //указатель на структуру квитанции
SERVER *,        //указатель на структуру "Хранилище"
ID_SERVER *,   //указатель на структуру "реестр"
u32 ,      //индекс в Хранилище
u32 ,      //CMD_ID
u32 ,      //SENDER_ID
u64 ,      //TIME
u64        //CMD_ID
); 

void SERV_ID_DEL //процедура удаления команды из реестра
(
ID_SERVER *,     //указатель на структуру "реестр"
u32        //индекс команды в реестре
);

u32 TX_MSG_BUFF (//заполняем транспортный массив
Frame *,      //структура квитанции
uint8 *,      //транспортный массив
u32         //максимальный размер транспортного массива 
);

u32 SYS_CMD_MSG(
ID_SERVER *,  //реестр
Frame *,    //структура квитанций 
u32 ,     //индекс в реестре
u32 ,     //тип сообщения
u32 ,     //объём данных сообщения в байтах
u8 *,     //данные сообщения - массив данных
u32         //время составления квитанции
);

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
